/**
 * https://mp.weixin.qq.com/s/GiIIS-b00AZGHCxxMMTN5w
 * 
 * mock
 */


/**
 * (1) 前端mock要有哪些功能
 * 
 * - 1.mock功能和前端代码解耦
 * - 2.一个接口支持多种mock情况
 * - 3.无需依赖另外的后端服务和第三方库
 * - 4.能在network看到mock接口的请求且能区分
 * - 5.mock数据、接口配置和页面在同一个目录下
 * - 6.mock配置改变无需重启前端dev
 * - 7.生产打包可以把mock数据注入到打包的js中走前端mock
 * - 8.对于后端已有的接口也能快速把Response数据转化为mock数据
 * 
 * 
 * 对于第7点的作用是后续项目开发完成，在完全没有开发后端服务的情况下，也可以进行演示。
 * 这对于一些ToB定制的项目来沉淀项目地图（案例）很有作用。
 * 
 * 对于第8点在开发环境后端服务经常不稳定下，不依赖后端也能做页面开发，核心是能实现一键生成mock数据。
 */


/**
 * 
 */


